### DataFrame 생성

#### pd.DataFrame(data=None,index: Union[Collection, NoneType] = None, columns: Union[Collection, NoneType] = None,  dtype: Union[str, numpy.dtype, ForwardRef('ExtensionDtype'), NoneType] = None,   copy: bool = False)

In [ ]:
pd.DataFrame?

In [2]:
import pandas as pd

In [4]:
friend_dict_list = [
    {
        "name": "John",
        "age": 25,
        "job": "student",
    },
    {
        "name": "Nate",
        "age": 30,
        "job": "teacher",
    },
    {
        "name": "Jenny",
        "age": 30,
        "job": "developer",
    },
]

df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [12]:
# name 컬럼만 보고 싶다면?

print(df["name"])

df.name

0     John
1     Nate
2    Jenny
Name: name, dtype: object

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [10]:
# age 컬럼만 보고 싶다면?

print(df["age"])

df.age

0    25
1    30
2    30
Name: age, dtype: int64

0    25
1    30
2    30
Name: age, dtype: int64

### loc : 인덱스 값이 오거나, 컬럼명이 와야 함

In [27]:
df.loc?

In [21]:
#  Nate와 Jenny 만 추출하고 싶다면?

print(df[1:3])

# loc 는 라벨이 있을 때 주로 사용/ 여러 개의 라벨을 지정할 때는 리스트 구조로 넘겨야 함
df.loc[[1,2]]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [22]:
# John, Jenny 만 보고 싶다면?

df.loc[[0, 2]]

    name  age        job
0   John   25    student
2  Jenny   30  developer

In [26]:
# loc[]로 원하는 행과 열을 여러개 가져올 때

df.loc[[1,2],["name","job"]]

    name        job
1   Nate    teacher
2  Jenny  developer

### iloc : index location(인덱스 값이 오거나, 컬럼 인덱스가 오거나)

In [23]:
# 0번 행의 정보 가져올 때

df.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [24]:
# iloc[] 1번 행의 0번 칼럼의 값

df.iloc[1,0]

'Nate'

In [24]:
df.iloc[0,1]

25

### column condition

In [12]:
# 나이가 25살보다 많은 사람 추출

df[df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [5]:
# 위와 동일한 작업인데 query 메소드 사용

df.query("age>25")

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer